整個故事在東漢末年至西晉初的歷史大背景下展開。東漢末年，皇帝昏聵無能，宦官專權，朝廷腐敗，百姓苦不堪言，進而爆發了大型農民起義——黃巾起義。亂世之中，一代梟雄與英雄人物競相涌現。
是時，袁紹和曹操領眾諸侯以平“十常侍之亂”為名沖入皇宮，漢少帝劉辯與陳留王劉協慌亂出逃。在各路諸侯爭相尋找劉辯和劉協的過程中，原屯兵涼州的董卓因救駕有功隨即掌控朝中大權，廢漢少帝，立陳留王劉協為漢獻帝。生性殘暴的董卓倒行逆施，引發多方憤然。曹操假借聖旨之名，召集群雄聯合討伐董卓，迫使其挾漢獻帝至長安。董卓後被其義子呂布所殺。
此後，袁紹欲謀長沙太守孫堅手中的傳國玉璽，孫堅在逃避途中遭荊州劉表所襲而兩相結怨。孫堅在後進攻荊州之時死於戰中。與此同時，袁紹與公孫瓚在河北地界爭鬥，爆發界橋之戰。曹操廣泛招賢納才，劉備不斷擴充實力。此時，群雄逐鹿中原的雛形初成。


漢朝末年黃巾起義形勢 
董卓死後，曹操“挾天子以令諸侯”，迎漢獻帝於許昌建都，並運用權謀除去了呂布、袁術等人。在其後的官渡之戰中，曹操以少勝多大敗袁紹，繼而一統北方，為此後魏國的建立奠定了堅實的基礎。
在江東，孫堅之子孫策多年苦心經營，終於稱霸江東六郡八十一州。孫策亡故後，其弟孫權繼業。孫權在周瑜等人扶持下，為吳國的建立積聚了強大的實力。劉備則與關羽、張飛二人桃園結義，共同立起輔佐漢室的大旗。劉備在汝南遭曹操戰敗，投奔荊州劉表。而後劉備三顧茅廬，請得足智多謀而又心懷天下的諸葛亮輔佐。
曹操統一北方後開始舉兵南征，矛頭直指荊州和江都。此時，劉表亡故，其長子劉琦守江夏。次子劉琮接管荊州，後投降曹操，荊州於是落入曹操手中。面對曹操南征之勢，劉備遣諸葛亮往江東與孫權結盟。諸葛亮憑藉機智在江東舌戰群儒，最終促成孫、劉聯軍，併在赤壁之戰中通過反間計、連環計、苦肉計等一系列有步驟、有計劃的行動，大破曹軍，譜寫了中國古代戰爭史上以少勝多的光輝篇章。
赤壁大戰過後，劉備、孫權轉而互爭荊州。孫權遣魯肅向劉備討還荊州，劉備在諸葛亮的勸諭下多次推辭。周瑜向孫權獻計，欲騙劉備前往東吳迎娶孫權之妹孫尚香為妻，進而扣留劉備，威逼諸葛亮以荊州換之。不料周瑜的計謀都被諸葛亮屢屢識破，致使其“賠了夫人又折兵”。周瑜最終在諸葛亮的譏諷中嘔血而亡，留下了“既生瑜，何生亮”的長嘆。
周瑜死後，吳軍忙於與曹軍開戰。曹操平定西涼馬超、韓遂後，先後進爵魏公、魏王，劉備則在諸葛亮的勸說下打敗劉璋，奪取西川，並從曹操手中奪得漢中，自封漢中王。後東吳與曹魏修好，孫權受封南昌侯。東吳大將呂蒙以白衣渡江之計奪取荊州。此時正在攻打樊城的關羽不得不退守麥城併在突圍過程中被擒。關羽寧死不降而被孫權斬首。與此同時，曹操去世，其子曹丕繼承魏王的爵位，進而篡漢稱魏帝；劉備也已在益州稱帝，國號漢；孫權則坐鎮江東一方。至此，天下大勢底定，三國鼎立局面形成。
稱帝後的劉備，執意東征吳國。出兵前夕，張飛亦被部下範強、張達所殺，劉備痛心疾首，揮師東進。孫權拜陸遜為大都督，在夷陵之戰中大敗蜀軍。劉備在率敗軍撤至白帝城之時病倒，併在臨終前向諸葛亮托孤。曹丕此時趁機聯合東吳、南蠻、羌族和蜀漢降將孟達進攻蜀國。諸葛亮派出馬超、趙雲等猛將把守關口，又派出李嚴，鄧芝等人說服孟達與東吳。諸葛亮則親領大軍七擒七縱，平定了南蠻孟獲之亂。
後曹丕病逝，其子曹睿即位。諸葛亮六齣祁山，決心為劉備完成匡複漢室的遺願。在此期間，諸葛亮收服薑維並以己平生所學相授。諸葛亮最終因操勞過度在五丈原病逝。薑維繼承諸葛亮遺志，繼續興兵抗魏卻被昏主姦臣所害，退避閬中。魏將鄧艾趁蜀國內亂之際發兵進攻，蜀主劉禪不戰而降，蜀漢至此滅亡。薑維圖謀復國，也在魏軍的圍攻下身負重傷，拔劍自刎。
東吳孫權死後，內亂不止，吳主孫亮被獨攬大權的孫琳所廢，孫休被立為帝。孫休聯合老將丁奉除掉孫琳將大權奪回手中，但東吳此時也已呈現大江東去之勢。在魏國，曹睿死後曹芳繼位，司馬懿從曹爽手中奪得兵權。後曹芳被廢，司馬兄弟立曹髦為帝，司馬師死後，司馬昭大權獨攬。最後，司馬昭之子司馬炎篡位，改國號為晉，魏國滅。吳國最終也被西晉所滅。
“天下大勢，分久必合，合久必分”，百年戰亂終於在此划下句點，西晉開拓了中國曆史上又一個大一統的局面